In [2]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
#1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
data = [4,8,15,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
#2.Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
my_list = [90,40,20,65,35,78,12,45,63,98]
my_series = pd.Series(my_list)
print(my_series)

0    90
1    40
2    20
3    65
4    35
5    78
6    12
7    45
8    63
9    98
dtype: int64

In [7]:
#3.
my_data = { "Name" : ['Alice' , 'Bob', 'Clarie'] ,
           "Age" : [25,30,27],
           "Gender" : [ 'Female' , 'Male', 'Female']}
df = pd.DataFrame(my_data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [8]:
#Q4. Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
# Dtaframe  : In Pandas, a DataFrame is a two-dimensional labeled data structure with columns that can hold different data types. It can be thought of as a table-like data structure similar to a spreadsheet or a SQL table. Each column in a DataFrame can be thought of as a Pandas Series, and the DataFrame provides a way to organize multiple Series into a coherent whole.
# Series : A Pandas Series is a one-dimensional labeled array that can hold data of any type, including integers, strings, floating-point numbers, etc. It's essentially a single column of data with associated labels, called an index. A DataFrame, on the other hand, is a collection of multiple Series, where each Series represents a column of data.

In [9]:
#Example: series
fruits = pd.Series(['Apple' ,'Banana' , 'orange' , 'mango' , 'guava'])
print("The series of the fruits are:")
print(fruits)

The series of the fruits are:
0     Apple
1    Banana
2    orange
3     mango
4     guava
dtype: object

In [10]:
#Example: Dataframe
my_data = { "Name" : ['Alice' , 'Bob', 'Clarie'] ,
           "Age" : [25,30,27],
           "Gender" : [ 'Female' , 'Male', 'Female']}
df = pd.DataFrame(my_data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [12]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [15]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
# Series: Generally mutable, but more limited compared to DataFrames.
# DataFrame: Mutable, you can modify its content, add columns, etc.
# Panel: Not available in recent Pandas versions.

In [32]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.
fruit_series = pd.Series(['Apple' ,'Banana' , 'orange' , 'mango' , 'guava'])
Animal_series = pd.Series(['Tiger' , 'Lion' , 'Elephant' , 'Deer', 'Cat'])
Hell_series = pd.Series(['Atal' ,'bital' ,'Sutal' , 'Talatal','Rasatal' , 'Patal'])
data = { 'FRUIT NAME' : fruit_series , 'Animal name' : Animal_series , 'Hell name' 
df = pd.DataFrame([fruit_series , Animal_series , Hell_series])
print("FRUIT NAME")
print("Animal name")
print("Hell name")
print(df)

FRUIT NAME
Animal name
Hell name
       0       1         2        3        4      5
0  Apple  Banana    orange    mango    guava    NaN
1  Tiger    Lion  Elephant     Deer      Cat    NaN
2   Atal   bital     Sutal  Talatal  Rasatal  Patal

In [28]:
type(df)

pandas.core.frame.DataFrame